wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pmu.c
        /* select WFI or WFE command to enter sleep mode */
        if(WFI_CMD == sleepmodecmd) {
            __WFI();
        } else {
            __SEV();
            __WFE();
            __WFE();
        }
    }
}

/*!
    \brief      enter deepsleep mode (API_ID(0x0022U))
    \param[in]  deepsleepmodecmd:
                only one parameter can be selected which is shown as below:
      \arg        WFI_CMD: use WFI command
      \arg        WFE_CMD: use WFE command
    \param[out] none
    \retval     none
*/
void pmu_to_deepsleepmode(uint8_t deepsleepmodecmd)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_SLEEPMODE(deepsleepmodecmd)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear standby mode */
        PMU_CTL0 &= ~((uint32_t)(PMU_CTL0_STBMOD));

        /* set sleepdeep bit of Cortex-M7 system control register */
        SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

        /* select WFI or WFE command to enter deepsleep mode */
        if(WFI_CMD == deepsleepmodecmd) {
            __WFI();
        } else {
            __SEV();
            __WFE();
            __WFE();
        }
        /* reset sleepdeep bit of Cortex-M7 system control register */
        SCB->SCR &= ~((uint32_t)SCB_SCR_SLEEPDEEP_Msk);
    }
}

/*!
    \brief      enter standby mode (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
void pmu_to_standbymode(void)
{
    /* set stbmod bit */
    PMU_CTL0 |= PMU_CTL0_STBMOD;

    /* reset wakeup flag */
    PMU_CTL0 |= PMU_CTL0_WURST;

    /* set sleepdeep bit of Cortex-M7 system control register */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    REG32(0xE000E010U) &= 0x00010004U;
    REG32(0xE000E180U) = 0xFF87FFFFU;
    REG32(0xE000E184U) = 0x7FFFFBFFU;
    REG32(0xE000E188U) = 0x9FFFFFF0U;
    REG32(0xE000E18CU) = 0xB577E043U;
    REG32(0xE000E190U) = 0x7FC70200U;
    REG32(0xE000E194U) = 0xFFFBFFFEU;
    REG32(0xE000E198U) = 0xEFFFFFFFU;
    REG32(0xE000E19CU) = 0x00000007U;

    /* enter standby mode */
    __WFI();
}

/*!
    \brief      enable wakeup pin (API_ID(0x0024U))
    \param[in]  wakeup_pin:
                one or more parameters can be selected which are shown as below:
      \arg        PMU_WAKEUP_PIN0: WKUP Pin 0
      \arg        PMU_WAKEUP_PIN1: WKUP Pin 1
      \arg        PMU_WAKEUP_PIN3: WKUP Pin 3
      \arg        PMU_WAKEUP_PIN5: WKUP Pin 5
    \param[out] none
    \retval     none
*/
void pmu_wakeup_pin_enable(uint32_t wakeup_pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_WAKEUP_PIN(wakeup_pin)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0024U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        PMU_CS |= wakeup_pin;
    }
}

/*!
    \brief      disable wakeup pin (API_ID(0x0025U))
    \param[in]  wakeup_pin:
                one or more parameters can be selected which are shown as below:
      \arg        PMU_WAKEUP_PIN0: WKUP Pin 0
      \arg        PMU_WAKEUP_PIN1: WKUP Pin 1
      \arg        PMU_WAKEUP_PIN3: WKUP Pin 3
      \arg        PMU_WAKEUP_PIN5: WKUP Pin 5
    \param[out] none
    \retval     none
*/
void pmu_wakeup_pin_disable(uint32_t wakeup_pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_WAKEUP_PIN(wakeup_pin)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        PMU_CS &= ~(wakeup_pin);
    }
}

/*!
    \brief      enable backup domain write (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_backup_write_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_BKPWEN;
}

/*!
    \brief      disable backup domain write (API_ID(0x0027U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_backup_write_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_BKPWEN;
}

/*!
    \brief      enable backup voltage stabilizer (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
void pmu_backup_voltage_stabilizer_enable(void)
{
    PMU_CTL1 |= PMU_CTL1_BKPVSEN;
    while(RESET == (PMU_CTL1 & PMU_CTL1_BKPVSRF)) {
    }
}

/*!
    \brief      disable backup voltage stabilizer (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_backup_voltage_stabilizer_disable(void)
{
    PMU_CTL1 &= ~PMU_CTL1_BKPVSEN;
}

/*!
    \brief      configure IRC counter before enter Deep-sleep mode (API_ID(0x002AU))
    \param[in]  wait_time: 0x0~0x1F, IRC counter before enter Deep-sleep mode
    \param[out] none
    \retval     none
*/
void pmu_enter_deepsleep_wait_time_config(uint32_t wait_time)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_ENTER_WAITTIME(wait_time)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x002AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        uint32_t temp;
        temp = PMU_PAR;
        temp &= ~PMU_PAR_TSW_IRCCNT;
        temp |= (uint32_t)(wait_time << PAR_TSW_IRCCNT_OFFSET);
        PMU_PAR = temp;
    }
}

/*!
    \brief      configure IRC counter before exit Deep-sleep mode (API_ID(0x002BU))
    \param[in]  wait_time: 0x0~0xFFF, IRC counter before exit Deep-sleep mode
    \param[out] none
    \retval     none
*/
void pmu_exit_deepsleep_wait_time_config(uint32_t wait_time)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_EXIT_WAITTIME(wait_time)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x002BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        uint32_t temp;
        temp = PMU_PAR;
        temp &= ~PMU_PAR_PWR_CNT;
        temp |= (uint32_t)(wait_time);
        PMU_PAR = temp;
    }
}

/*!
    \brief      enable CORE PDR circuit (API_ID(0x002CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_core_pdr_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_COREPDREN;
}

/*!
    \brief      disable CORE PDR circuit (API_ID(0x002DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_core_pdr_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_COREPDREN;
}

/*!
    \brief      enable CORE POR OFF output (API_ID(0x002EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_core_por_off_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_COREPOROFFOUT;
}

/*!
    \brief      disable CORE POR OFF output (API_ID(0x002FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_core_por_off_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_COREPOROFFOUT;
}

/*!
    \brief      enable CORE POR OFF output polarity negation (API_ID(0x0030U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_output_polarity_negation_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_COREPOROFFP;
}

/*!
    \brief      disable CORE POR OFF output polarity negation (API_ID(0x0031U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_output_polarity_negation_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_COREPOROFFP;
}

/*!
    \brief      select sram mode in deep-sleep (API_ID(0x0032U))
    \param[in]  mode:
                only one parameter can be selected which is shown as below:
      \arg        PMU_DISABLE: disable
      \arg        PMU_PRECHARGE: select precharge
      \arg        PMU_RETENTION: select retention
    \param[out] none
    \retval     none
*/
void pmu_sram_mode_selection(uint32_t sram_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SRAM_MODE(sram_mode)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0032U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        PMU_CTL0 &= ~PMU_CTL0_SRAM_MODE;
        PMU_CTL0 |= (sram_mode & PMU_CTL0_SRAM_MODE);
    }
}

/*!
    \brief      configure VUVD analog output filter length (API_ID(0x0033U))
    \param[in]  length: 0~255, filter length is configured as length*1024*Tpclk4
    \param[out] none
    \retval     none
*/
void pmu_vuvd_output_config(uint32_t length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_FILTER_LENGTH(length)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0033U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp = (length & 0xFFU) << 8;
        PMU_CTL2 &= ~PMU_CTL2_VUVDO_DNF;
        PMU_CTL2 |= temp;
    }
}

/*!
    \brief      configure VOVD analog output filter length (API_ID(0x0034U))
    \param[in]  length: 0~255, filter length is configured as length*1024*Tpclk4
    \param[out] none
    \retval     none
*/
void pmu_vovd_output_config(uint32_t length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_FILTER_LENGTH(length)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0034U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        PMU_CTL2 &= ~PMU_CTL2_VOVDO_DNF;
        PMU_CTL2 |= (length & 0xFFU);
    }
}

/*!
    \brief      enable MIPI LDO (API_ID(0x0035U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_ldo_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_MIPI_LDO_EN;
}

/*!
    \brief      disable MIPI LDO (API_ID(0x0036U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_ldo_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_MIPI_LDO_EN;
}

/*!
    \brief      enable MIPI power (API_ID(0x0037U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_power_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_MIPISW;
}

/*!
    \brief      disable MIPI power (API_ID(0x0038U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_power_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_MIPISW;
}

/*!
    \brief      enable MIPI output isolation (API_ID(0x0039U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_output_isolation_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_MIPIHTEN;
}

/*!
    \brief      disable MIPI output isolation (API_ID(0x003AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_output_isolation_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_MIPIHTEN;
}

/*!
    \brief      enable MIPI LDO bypass (API_ID(0x003BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_ldo_bypass_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_MIPI_LDO_BYP;
}

/*!
    \brief      disable MIPI LDO bypass (API_ID(0x003CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mipi_ldo_bypass_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_MIPI_LDO_BYP;
}

/*!
    \brief      select MIPI LDO VDD09DSI PDR threshold (API_ID(0x003DU))
    \param[in]  threshold:
                only one parameter can be selected which is shown as below:
      \arg        PDR_FALLING_THRESHOLD0: PDR falling threshold is 0.775V, POR rising threshold is 0.8V
      \arg        PDR_FALLING_THRESHOLD1: PDR falling threshold is 0.675V, POR rising threshold is 0.7V
    \param[out] none
    \retval     none
*/
void pmu_vdd09dsi_pdr_threshold_selection(uint8_t threshold_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_THRESHOLD_VALUE(threshold_value)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x003DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(threshold_value == PDR_FALLING_THRESHOLD0) {
            PMU_CTL3 &= ~PMU_CTL3_MIPI_PDR_LEV;
        } else {
            PMU_CTL3 |= PMU_CTL3_MIPI_PDR_LEV;
        }
    }
}

/*!
    \brief      enable MIPI LDO VDD09DSI PDR function (API_ID(0x003EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_vdd09dsi_pdr_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_MIPI_PDR_EN;
}

/*!
    \brief      disable MIPI LDO VDD09DSI PDR function (API_ID(0x003FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_vdd09dsi_pdr_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_MIPI_PDR_EN;
}

/*!
    \brief      clear flag bit (API_ID(0x0040U))
    \param[in]  flag_reset:
                only one parameter can be selected which is shown as below:
      \arg        PMU_FLAG_WAKEUP: wakeup flag
      \arg        PMU_FLAG_STANDBY: standby flag
      \arg        PMU_FLAG_RDYFALLF: record the occurrence of undervoltage reset on VDD09DSI
    \param[out] none
    \retval     none
*/
void pmu_flag_clear(uint32_t flag_reset)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_FLAG_RESET(flag_reset)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0040U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(flag_reset) {
        case PMU_FLAG_WAKEUP:
            PMU_CTL0 |= PMU_CTL0_WURST;
            break;
        case PMU_FLAG_STANDBY:
            PMU_CTL0 |= PMU_CTL0_STBRST;
            break;
        case PMU_FLAG_RDYFALLF:
            PMU_CTL3 |= PMU_CTL3_MIPI_RDY_FALL;
            break;
        default:
            /* Do nothing or add error handling */
            break;
        }
    }
}

/*!
    \brief      get flag state (API_ID(0x0041U))
    \param[in]  flag:
                only one parameter can be selected which is shown as below:
      \arg        PMU_FLAG_WAKEUP: wakeup flag
      \arg        PMU_FLAG_STANDBY: standby flag
      \arg        PMU_FLAG_LVDF: low voltage detector status flag
      \arg        PMU_FLAG_UVDF: record the undervoltage reset of the V0.9V
      \arg        PMU_FLAG_VUVDF0: V0.9V under voltage detector flag bit
      \arg        PMU_FLAG_VOVDF1: V0.9V over voltage detector flag bit after digital filter
      \arg        PMU_FLAG_VUVDF1: V0.9V under voltage detector flag bit after digital filter
      \arg        PMU_FLAG_VAVDF: VDDA analog voltage detector voltage output on VDDA flag
      \arg        PMU_FLAG_VOVDF0: peripheral voltage on V0.9V detector flag
      \arg        PMU_FLAG_PRDYN: the internal memory instance power supplies are stable after returning from retention mode
      \arg        PMU_FLAG_BKPVSRF: backup voltage stabilizer ready flag
      \arg        PMU_FLAG_VBATLF: VBAT level monitoring versus low threshold
      \arg        PMU_FLAG_VBATHF: VBAT level monitoring versus high threshold
      \arg        PMU_FLAG_TEMPLF: temperature level monitoring versus low threshold
      \arg        PMU_FLAG_TEMPHF: temperature level monitoring versus high threshold
      \arg        PMU_FLAG_RDYFALLF: record the occurrence of undervoltage reset on VDD09DSI
      \arg        PMU_FLAG_MIPIHTF: MIPI power switch ack flag
      \arg        PMU_FLAG_USB33RF: USB supply ready flag bit
      \arg        PMU_FLAG_RDYF: the MIPI_LDO output voltage ready signal
      \arg        PMU_FLAG_PKCAUHTF: PKCAU power switch ack flag
      \arg        PMU_FLAG_ESCHTF: ESC power switch ack flag
    \param[out] none
    \retval     FlagStatus SET or RESET
*/
FlagStatus pmu_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_FLAG(flag)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0041U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {

        if(PMU_REG_VAL(flag) & BIT(PMU_BIT_POS(flag))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}
